[M_Orchid_EndGame MissionDefinition]
MissionName="Treasure in the sand"
MissionDescription="You may have killed a Leviathan and found quicksand, but we have no reason to do the same to you!!"
TurnInDescription="You beat Scarlett. You have defeated Leviathan. And I found a treasure in the sand! Don't you think it's over??"
MissionSummary="Go to Manganese Lighthouse with Captain Blade's Compass."
MissionGiver="Oasis Bonus Dashboard"
MissionTurnInLocation="Avaza Awards Committee"
TeaserText="Lost happiness is still yours...!"

[M_Orchid_EndGame:ActivateBeacon MissionObjectiveDefinition]
ProgressMessage="light hair"

[M_Orchid_EndGame:ActivateBeaconSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Orchid_EndGame:ActivateBeaconSet2 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Orchid_EndGame:Activatelift MissionObjectiveDefinition]
ProgressMessage="Open the elevator."

[M_Orchid_EndGame:ActivateLiftSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Orchid_EndGame:BossWormBattleSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Orchid_EndGame:EscapeAmbushSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Orchid_EndGame:EscapeLeviathan MissionObjectiveDefinition]
ProgressMessage="Leviathan escaped."

[M_Orchid_EndGame:EscapeSpire MissionObjectiveDefinition]
ProgressMessage="Escape from the abyss"

[M_Orchid_EndGame:EscapeSpireSet MissionObjectiveSetDefinition]
MissionSummaryOverride="Escape Scarlett's hideout and find the treasure!!"
MissionDescriptionOverride="This is how you treat Scarlett. Unusual but still confusing. Soldiers will try to capture you in each level, so you have only one option. The goal is to kill them and try to reach the lost treasure in the sand before Scarlett does.."

[M_Orchid_EndGame:FindTreasure MissionObjectiveDefinition]
ProgressMessage="Find a library"

[M_Orchid_EndGame:FindWayUp MissionObjectiveDefinition]
ProgressMessage="I will find a way."

[M_Orchid_EndGame:FindWayUpSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Orchid_EndGame:FollowBeacon MissionObjectiveDefinition]
ProgressMessage="Follow the light"

[M_Orchid_EndGame:FollowBeaconSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Orchid_EndGame:GotoLighthouse MissionObjectiveDefinition]
ProgressMessage="Enter Magnus' Lighthouse."

[M_Orchid_EndGame:GotoLighthouseSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Orchid_EndGame:GotoLighthouseSet2 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Orchid_EndGame:GotoSpireSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Orchid_EndGame:InsertCompass MissionObjectiveDefinition]
ProgressMessage="Enter your compass"

[M_Orchid_EndGame:InsertCompassSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Orchid_EndGame:KillBossWorm MissionObjectiveDefinition]
ProgressMessage="Kill Leviathan"

[M_Orchid_EndGame:KillHenchmen MissionObjectiveDefinition]
ProgressMessage="Scarlett the killer"

[M_Orchid_EndGame:KillPirateQueen MissionObjectiveDefinition]
ProgressMessage="Defeat the red head"

[M_Orchid_EndGame:KillPirateQueenSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Orchid_EndGame:KillRoscoe MissionObjectiveDefinition]
ProgressMessage="Kill Roscoe"

[M_Orchid_EndGame:LeviathanSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Orchid_EndGame:LeviathanSet2 MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Orchid_EndGame:MeetScarlett MissionObjectiveDefinition]
ProgressMessage="I know Scarlett"

[M_Orchid_EndGame:MeetScarlettSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Orchid_EndGame:Opengate MissionObjectiveDefinition]
ProgressMessage="Open the door"

[M_Orchid_EndGame:OpenGateSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Orchid_EndGame:TreasureRoomSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Orchid_EndGame:UseLift MissionObjectiveDefinition]
ProgressMessage="Use the elevator"

[M_Orchid_EndGame:UseLiftSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

[M_Orchid_EndGame:WaitForLift MissionObjectiveDefinition]
ProgressMessage="I'm waiting for the elevator"

[M_Orchid_EndGame:WaitForLiftSet MissionObjectiveSetDefinition]
MissionSummaryOverride=""
MissionDescriptionOverride=""

